soap_requests/Authenticate.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Authenticate xmlns="urn:thesecretserver.com">
      <username>{{req_username}}</username>
      <password>{{req_password}}</password>
      <organization></organization>
      <domain></domain>
    </Authenticate>
  </soap:Body>
</soap:Envelope>